res_tip_helps=[{'canshow':1,'id':1,'desc':'武将士气可以提高武将技能被触发的概率，上限为150点'}
,{'canshow':1,'id':2,'desc':'跨国征战玩家可以获得荣誉，可用来在商城兑换道具'}
,{'canshow':1,'id':3,'desc':'挑战千层塔，装备宝石等你拿！'}
,{'canshow':1,'id':4,'desc':'执行君主任务可获得君主经验！'}
,{'canshow':1,'id':5,'desc':'君主等级超过10级就可以挑战千层塔！'}
,{'canshow':1,'id':6,'desc':'君主等级超过12级就可以挑战点将台！'}
,{'canshow':1,'id':7,'desc':'加入联盟后就可以增派援军了！'}
,{'canshow':1,'id':8,'desc':'在书院中研究建筑术，可以提高建筑速度！'}
,{'canshow':1,'id':9,'desc':'加入联盟后，就可以挑战世界Boss，奖励拿不停！'}
,{'canshow':1,'id':10,'desc':'挑战点将台，可获得武将内功和武勋！'}
,{'canshow':1,'id':11,'desc':'升级城池可扩大农场地块！'}
,{'canshow':1,'id':12,'desc':'升级城池可扩大城内可建造地块！'}
,{'canshow':1,'id':13,'desc':'升级城池可满足开启分城条件！'}
,{'canshow':1,'id':14,'desc':'训练士兵需要在书院研究对应的科技！'}
,{'canshow':1,'id':15,'desc':'消耗一定的精力，可以到其他君主农场中摘取四项资源！'}
,{'canshow':1,'id':16,'desc':'在新手保护期，换国免费！'}
,{'canshow':1,'id':17,'desc':'在铁匠铺中，可以购买装备！'}
,{'canshow':1,'id':18,'desc':'在铁匠铺中，可以强化装备！'}
,{'canshow':1,'id':19,'desc':'在铁匠铺中，可以合成宝石！'}
,{'canshow':1,'id':20,'desc':'在铁匠铺中，可以镶嵌宝石！'}
,{'canshow':1,'id':21,'desc':'在铁匠铺中，可以分解装备！'}
,{'canshow':1,'id':22,'desc':'升级医馆，可以提高药膏的生产速度！'}
,{'canshow':1,'id':23,'desc':'升级仓库，可以提高存放四项资源的上限！'}
,{'canshow':1,'id':24,'desc':'在城墙中，可以设定守城部队！'}
,{'canshow':1,'id':25,'desc':'修炼经脉，可以提高武将的最高等级上限！'}
,{'canshow':1,'id':26,'desc':'通过提升君主武力，可以提升兵力上限！'}
];


res_all_helps=[{'classtype':'农场','desc':'<p><font style="font-size:16px;color:#FFD700"><b>一、如何种植收获资源</b></font><br />1.玩家可以点击空地或者选择播种选择资源种子，一定时间后资源成熟，玩家可以先点击“征收”按钮，然后再点击资源成熟的地块征收资源。也可以点击“全部征收”一次性收获全部的成熟资源。<br />2.玩家可点击“提前征收”来征收正在生长中的资源，提前征收只能收获部分资源。 3.玩家可点击“犁地”来清空资源地，使之成为空地，重新选择种子进行种植。犁地会返给玩家该资源地的部分资源。 </p><p><font style="font-size:16px;color:#FFD700"><b>二、如何摘取其他玩家资源</b></font><br />1.玩家可以从好友列表选择对应好友农场，或者从野外地图直接点击城池进入，如果该农场有成熟的资源即可摘取，每次摘取消耗一点君主精力。 <br />2.每块地只能被同一玩家摘取一次，同一块地被采摘了一定次数后即不可再被采摘。</p><p><font style="font-size:16px;color:#FFD700"><b>三、升级金色土地</b></font><br />1.城池等级达到 城市2级 就会出现金色土地。 <br />2.金色土地可以使资源产量翻倍 <br />3.城池等级越高，就会有越多的普通土地升级为金色土地。</p>','id':1,'name':'农场规则'}
];


