res_pay_act_gifts=[{'itemid':3000245,'itemtip':'内含武将经验卡*20、精力卡*10、初级招贤榜*20、高级迁城令*1、斗王弓*1、4级灵石礼包*1','pri':1,'id':1,'allpay':500}
,{'itemid':3000247,'itemtip':'内含武将经验卡*30、精力卡*10、初级招贤榜*10、高级免战牌*1、4级灵石礼包*2、深渊之甲*1','pri':2,'id':2,'allpay':1000}
,{'itemid':3000249,'itemtip':'内含武将经验卡*30、精力卡*10、初级招贤榜*10、人和密卷*1、5级力量灵石*1、深渊之盔*1','pri':3,'id':3,'allpay':3000}
,{'itemid':3000251,'itemtip':'内含武将经验卡*40、精力卡*10、初级招贤榜*10、地利密卷*1、5级力量灵石*2、深渊之靴*1','pri':4,'id':4,'allpay':5000}
,{'itemid':3000253,'itemtip':'内含武将经验卡*50、精力卡*10、初级招贤榜*20、天时密卷*1、5级力量灵石*3、深渊之珮*1','pri':5,'id':5,'allpay':10000}
,{'itemid':3000255,'itemtip':'内含武将经验卡*80、精力卡*20、初级招贤榜*30、阵法残页盒*2、6级力量灵石*1、深渊之刃*1','pri':6,'id':6,'allpay':30000}
];


res_pay_act_returns=[{'desc':'充值1-999金币，返点40%；','id':1,'returnper':40,'allpay':1000}
,{'desc':'充值1000-1999金币，返点50%；','id':2,'returnper':50,'allpay':2000}
,{'desc':'充值3000-4999金币，返点55%；','id':3,'returnper':55,'allpay':5000}
,{'desc':'充值5000-9999金币，返点65%；','id':4,'returnper':65,'allpay':10000}
,{'desc':'充值10000-19999金币，返点80%；','id':5,'returnper':80,'allpay':20000}
,{'desc':'充值20000-49999金币，返点100%；','id':6,'returnper':100,'allpay':50000}
,{'desc':'充值大于50000金币，返点150%；','id':7,'returnper':150,'allpay':99999999}
];


